[{"id":"0","name":"Give Well","url":"https://www.givewell.org/charities/top-charities","logo":"https://www.givewell.org/sites/all/themes/gw_basic/logo.png","image":"./assets/images/logo_150.png","focus":"Global Poverty and Well-Being","short_desc":"We search for the charities that save or improve lives the most per dollar.","desc":"GiveWell is a nonprofit dedicated to finding outstanding giving opportunities and publishing the full details of our analysis to help donors decide where to give. Unlike charity evaluators that focus solely on financials, assessing administrative or fundraising costs, we conduct in-depth research aiming to determine how much good a given program accomplishes (in terms of lives saved, lives improved, etc.) per dollar spent. Rather than try to rate as many charities as possible, we focus on the few charities that stand out most (by our criteria) in order to find and confidently recommend high-impact giving opportunities.","request":{"type":"GET","url":"api/v0/evaluators/0"}},{"id":"1","name":"The Life You Can Save","url":"https://www.thelifeyoucansave.org/best-charities/","logo":"https://pbs.twimg.com/profile_images/1081106674864320512/7IzEpn0y_400x400.jpg","image":"./assets/images/logo_150.png","focus":"Women and Girls","short_desc":"We inspire effective giving in the fight against poverty","desc":"Galvanized by our founder Peter Singer, we are a group of people who speak out for a world in which all lives have equal value, no matter where they live. We inspire people to donate to charities that save or improve the most lives per dollar, aiming to create a world where everyone has an opportunity to build a good life and where there’s no suffering or death due to extreme poverty.","request":{"type":"GET","url":"api/v0/evaluators/1"}},{"id":"2","name":"80,000 Hours","url":"https://80000hours.org/articles/covid-19-options-for-donating/","logo":"https://netlify.scdn4.secure.raxcdn.com/images/logos/7ea12d7637d410a22834f124cb4268ea57a27a35/eightythousandhours.png","image":"./assets/images/logo_150.png","focus":"COVID-19 and Global Health","short_desc":"A guide to using your career to help solve the world’s most pressing problems","desc":"80,000 Hours aims to solve the most pressing skill bottlenecks in the world’s most pressing problems. We do this by providing research and support to help people switch into careers that effectively tackle these problems.","request":{"type":"GET","url":"api/v0/evaluators/2"}},{"id":"3","name":"Animal Charity Evaluators","url":"https://animalcharityevaluators.org/donation-advice/recommended-charities/","logo":"https://pbs.twimg.com/profile_images/803958923875139584/Bdu68ZFi_400x400.jpg","image":"./assets/images/logo_150.png","focus":"Helping Animals","short_desc":"Finding and promoting the most effective ways to help animals by using effective altruism principles to evaluate causes and research.","desc":"Animal Charity Evaluators (ACE) is a 501(c)(3) nonprofit registered in the United States dedicated to finding and promoting the most effective ways to help animals. ACE aids compassionate givers, professionals, and volunteers in making informed decisions about how to help animals as effectively as possible. We strive to identify ways to alleviate suffering and improve the lives of animals on a wide scale, while continuously updating our recommendations based on new evidence. We oppose all systems of oppression and recognize that they are connected and mutually reinforcing.","request":{"type":"GET","url":"api/v0/evaluators/3"}}]