[{"id":"0","name":"SCI Foundation","url":"https://schistosomiasiscontrolinitiative.org/","address":"0xD3f4370F33627840C54361823971Ace0D433Be1e","logo":"https://pbs.twimg.com/profile_images/1055386759641612289/DMCppST6_400x400.jpg","image":"./assets/images/logo_150.png","short_desc":"We support the delivery of cost-effective and impactful health programmes in Sub-Saharan Africa, helping to create a world free from preventable disease.","desc":"SCI (schistosomiasiscontrolinitiative.org) works with governments in sub-Saharan Africa to create or scale up programs that treat schistosomiasis and soil-transmitted helminthiasis (STH) ('deworming'). SCI's role has primarily been to identify country recipients, provide funding to governments for government-implemented programs, provide advisory support, and conduct monitoring and evaluation on the process and outcomes of the programs.","evaluatorId":{"_id":"0","name":"Give Well"},"stats":{"metric1":"Deworming is generally highly cost-effective. We estimate that children are dewormed for a total of around $0.99 per child in SCI-supported programs. This figure relies on several difficult-to-estimate inputs including how to account for (a) donated drugs and (b) in-kind contributions from governments with which SCI works. Excluding drugs and government contributions, we estimate that SCI's cost per treatment is $0.32.","metric2":456},"request":{"type":"GET","url":"api/v0/nonprofits/0"}},{"id":"1","name":"Fistula Foundation","url":"https://www.thelifeyoucansave.org/best-charities/fistula-foundation/","address":"0x143Ee9c8c36BBF9AAE54c68f05d4CA11d805420B","logo":"https://pbs.twimg.com/profile_images/378800000440201956/2ee96965e41e37e42e8eb8cf74ed5172_400x400.png","image":"https://cdn.thelifeyoucansave.org/uploads/2019/11/Madagascar_Aug17_0763_flipped.jpg","short_desc":"Fistula Foundation is focused globally on treating the childbirth injury obstetric fistula, currently funding partners in 20+ countries in Africa & Asia.","desc":"Fistula Foundation is the global leader in treating obstetric fistula, a devastating childbirth injury that leaves women incontinent, humiliated, and often shunned by their communities. In addition to covering direct surgery costs, Fistula Foundation also supports training surgeons, equipping facilities, grassroots community outreach, and holistic post-surgery reintegration.","evaluatorId":{"_id":"1","name":"The Life You Can Save"},"stats":{"metric1":"Obstetric fistula can be cured by a surgery that costs an estimated $694. The suffering and health burden averted is comparable to the most cost-effective health interventions, such as vaccines and bed nets.","metric2":456},"request":{"type":"GET","url":"api/v0/nonprofits/1"}},{"id":"2","name":"The Center for Global Development","url":"https://www.cgdev.org/topics/coronavirus","address":"0x3195298fcFe9772aC77aA9865E7e8072C51938bf","logo":"https://pbs.twimg.com/profile_images/730084284120346626/BPNHoZ4H_400x400.jpg","image":"./assets/images/logo_150.png","short_desc":"Independent research & ideas for global prosperity.","desc":"At CGD, we are examining the toll that the spread of COVID-19 is taking on global development—people, systems, and economies—and how governments and international organizations can best respond. Our experts are also assessing global pandemic preparedness and financing, and in particular how the outbreak will and is affecting low- and middle-income countries—including in Africa—with already-stretched health systems. Drawing upon our work on strengthening health systems and lessons from the 2014-2016 Ebola outbreak in West Africa, we’ve put together thinking and options on how global institutions and countries can better prepare for pandemic threats today and in the future. ","evaluatorId":{"_id":"2","name":"80,000 Hours"},"stats":{"metric1":"Successful track record in advocating for policies to help the global poor. They’ve recently decided to make the response to COVID-19 in middle and low income countries a significant focus, and are developing policy advice for these countries, who are often unable to access the expertise they need from multilateral bodies like the G-7 and the World Bank.","metric2":456},"request":{"type":"GET","url":"api/v0/nonprofits/2"}},{"id":"3","name":"Albert Schweitzer Foundation","url":"https://albertschweitzerfoundation.org/","address":"0xF0a9b6973B10406FF73615Ca7f1C36E967624F4A","logo":"https://files.albertschweitzerfoundation.org/1/ASF_-_Logo_264x66px.svg","image":"https://files.albertschweitzerfoundation.org/1/team-leitbild_700x400.jpg","short_desc":"Help to bring about positive change for the animals.","desc":"Albert Schweitzer Foundation (ASF) conducts corporate outreach campaigns and a variety of vegetarian outreach campaigns. They are one of the first animal charities conducting corporate outreach campaigns on behalf of fishes.","evaluatorId":{"_id":"3","name":"Animal Charity Evaluators"},"stats":{"metric1":"From an average $1,000 donation, ASF would spend about $617 on corporate outreach, $216 on legal advocacy, and $166 on corporate campaigns.","metric2":456},"request":{"type":"GET","url":"api/v0/nonprofits/3"}}]